import os


BOT_TOKEN = "8246322490:AAEVCPmrUXFSvW-TnZTsz15tWTO3sAOayPQ"
ADMIN_ID = 826740859

# Настройки экономики
START_BALANCE = 250
REFERRAL_REWARD = 500    # Награда за друга

# Модификаторы редкости (Множитель, Шанс%)
MODIFIERS = {
    "Мусор": (0.01, 10),       # Убыток (x0.01)
    "Сломанное": (0.1, 20),    # Убыток (x0.1)
    "Поношенное": (0.5, 25),   # Убыток (x0.5)
    "Обычное": (1, 30),
    "Редкое": (1.5, 12),
    "Эпическое": (2.5, 2),
    "Легендарное": (10.0, 1),  # Джекпот
}

ITEMS_DB = [
    ("носок", 5), ("ложка", 10), ("Пустая банка", 15),
    ("Кирпич", 25), ("Деревянная палка", 30), ("Ржавый гвоздь", 40),
    ("Фонарик", 80), ("Батарейка", 90), ("Журнал", 100),
    ("Кроссовки", 150), ("Рюкзак", 170), ("Часы Casio", 200),
    ("Наушники", 270), ("Клавиатура", 300), ("Монитор", 350),
    ("Смартфон", 500), ("Планшет", 800), ("Ноутбук", 1300),
    ("Игровая консоль", 1500), ("Видеокарта", 2000), ("Дрон", 2400),
    ("Золотое кольцо", 8000), ("Цепочка", 10000), ("Браслет", 11000),
    ("Слиток серебра", 15000), ("Слиток золота", 30000), ("Алмаз", 50000),
    ("Ключи от машины", 100000), ("Документы на дом", 300000), ("Биткоин", 500000)
]

CONTAINERS = {
    "c1": {"name": "📦 Бомж-пакет", "price": 100, "range": (0, 8)},
    "c2": {"name": "📦 Начинающий", "price": 250, "range": (2, 12)},
    "c3": {"name": "📦 Любитель", "price": 500, "range": (5, 15)},
    "c4": {"name": "📦 Опытный", "price": 1000, "range": (8, 18)},
    "c5": {"name": "📦 Профи", "price": 2500, "range": (12, 20)},
    "c6": {"name": "📦 Стример", "price": 5000, "range": (15, 22)},
    "c7": {"name": "📦 Мажор", "price": 10000, "range": (18, 25)},
    "c8": {"name": "📦 Олигарх", "price": 25000, "range": (20, 27)},
    "c9": {"name": "📦 Шейх", "price": 75000, "range": (22, 28)},
    "c10": {"name": "📦 Илон Маск", "price": 200000, "range": (24, 29)},
}